import os

# ================================
# 🔐 TOKEN БОТА
# ================================
# Можно хранить токен прямо здесь:
# BOT_TOKEN = "YOUR_BOT_TOKEN_HERE"

# Но лучше брать из переменных окружения (GitHub Secrets / Hosting)
BOT_TOKEN = os.getenv("BOT_TOKEN", "8134649307:AAH3k13igSnG9t6lGYYTvu7e2D4RiKaCXMI")


# ================================
# 👑 СПИСОК АДМИНОВ
# ================================
# Можешь указать одного или несколько ID:
# Например: ADMINS = [7967404620]

ADMINS = [
    123456789,  # ← замени на свой Telegram ID
]


# ================================
# ⚙️ ПРОЧИЕ НАСТРОЙКИ
# ================================

# Название проекта
PROJECT_NAME = "Who?Anonim™ Bot"

# Включить логирование всех сообщений?
DEBUG = True

# Файл БД SQLite
DATABASE_PATH = "who_anonim_bot/db/database.sqlite3"
